# EnableLBSingleLineSelection

## Description
Enables single line only selection.  Multiple selections will not be permitted.

```pascal
FUNCTION EnableLBSingleLineSelection(
				dialogID    : LONGINT;
				componentID : LONGINT;
				enable      : BOOLEAN) : BOOLEAN;
```

```python

def vs.EnableLBSingleLineSelection(dialogID, componentID, enable):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dialogID|LONGINT|id of the dialog that contains the list browser|
|componentID|LONGINT|id of the list browser control|
|enable|BOOLEAN|determines if single line selection only should be enabled.|

## Version
Availability: from VectorWorks12.0
## Category
* Dialogs - Modern - Browser